{
  "nodes": [
    {
      "op": "null", 
      "name": "input_view", 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose1", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "num_filter": "32"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "num_filter": "32"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "input_feature", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[14, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected7_weight", 
      "attrs": {"num_hidden": "33"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected7_bias", 
      "attrs": {"num_hidden": "33"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected7", 
      "attrs": {"num_hidden": "33"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_sub1", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[20, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[25, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1", 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "target", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "action", 
      "inputs": []
    }, 
    {
      "op": "one_hot", 
      "name": "one_hot1", 
      "attrs": {"depth": "33"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[29, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum3", 
      "attrs": {"axis": "1"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus1", 
      "inputs": [[31, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square1", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mask", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum4", 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum5", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div1", 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss1", 
      "inputs": [[42, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    6, 
    7, 
    11, 
    12, 
    15, 
    16, 
    17, 
    21, 
    22, 
    26, 
    27, 
    31, 
    32, 
    38
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44
  ], 
  "heads": [[30, 0, 0], [43, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}